DataProcessors/ТелеграмКомпоновкаСообщенийГруппы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<DataProcessor>
		<Properties>
			<Name>ТелеграмКомпоновкаСообщенийГруппы</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ТелеграмСообщенияГруппыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<AccumulationRegister>
		<Properties>
			<Name>ТелеграмСообщенияГруппыСообщений</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмГруппаСообщений</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелеграмГруппыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипВложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмВложенияСообщенийВходящих.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмВложенияСообщенийВходящих</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПутьКФайлу</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелеграмСообщенияВходящие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПутьФайлаВТелеграме</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПрогрессВыполненияСерверныхПроцедур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ПрогрессВыполненияСерверныхПроцедур</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прогресс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПолноеИмяОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмГруппыСообщенийСостояние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмГруппыСообщенийСостояние</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Открыта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмГруппаСообщений</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ТелеграмГруппыСообщений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ТелеграмГеоданныеКонтакта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ТелеграмГеоданныеКонтакта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>latitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>longitude</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТелеграмКонтакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмКонтакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ТелеграмКомпоновкаСообщенийГруппы/Ext/ObjectModule.bsl
Функция СкомпоноватьСообщенияГруппыЛинейно(ТелеграмГруппаСообщений, НазваниеГруппы = "") Экспорт
	
	
	РабочийКаталог = Константы.КаталогФайловРабочий.Получить();
	ПолныйПутьКПапке = РабочийКаталог + "\Telegram\assembled\" + Формат(ТелеграмГруппаСообщений.Дата, "ДФ=yyyy-MM-dd") + "_" + Формат(ТелеграмГруппаСообщений.Номер, "ЧДЦ=0; ЧГ=0") + ?(НазваниеГруппы = "", "","_" + НазваниеГруппы); 
	СоздатьКаталог(ПолныйПутьКПапке);
		
	ЗапросСообщенийГруппы = Новый ЗАпрос();
	ЗапросСообщенийГруппы.Текст = "ВЫБРАТЬ
	                              |	ТелеграмСообщенияГруппыСообщенийОбороты.Регистратор КАК Регистратор,
	                              |	ТелеграмВложенияСообщенийВходящих.ПутьФайлаВТелеграме КАК ПутьФайлаВТелеграме,
	                              |	ТелеграмВложенияСообщенийВходящих.Тип КАК Тип,
	                              |	ТелеграмВложенияСообщенийВходящих.Описание КАК Описание,
	                              |	ТелеграмВложенияСообщенийВходящих.Размер КАК Размер,
	                              |	ТелеграмВложенияСообщенийВходящих.ПутьКФайлу КАК ПутьКФайлу,
	                              |	ТелеграмВложенияСообщенийВходящих.ДатаЗагрузки КАК ДатаЗагрузки,
	                              |	ТелеграмСообщенияГруппыСообщенийОбороты.Регистратор.Текст КАК РегистраторТекст,
	                              |	ТелеграмСообщенияГруппыСообщенийОбороты.Регистратор.Дата КАК РегистраторДата
	                              |ИЗ
	                              |	РегистрНакопления.ТелеграмСообщенияГруппыСообщений.Обороты(, , Регистратор, ТелеграмГруппаСообщений = &ТелеграмГруппаСообщений) КАК ТелеграмСообщенияГруппыСообщенийОбороты
	                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелеграмВложенияСообщенийВходящих КАК ТелеграмВложенияСообщенийВходящих
	                              |		ПО ТелеграмСообщенияГруппыСообщенийОбороты.Регистратор = ТелеграмВложенияСообщенийВходящих.Сообщение
	                              |
	                              |УПОРЯДОЧИТЬ ПО
	                              |	ТелеграмСообщенияГруппыСообщенийОбороты.Период,
	                              |	ДатаЗагрузки
	                              |ИТОГИ ПО
	                              |	Регистратор";
	ЗапросСообщенийГруппы.УстановитьПараметр("ТелеграмГруппаСообщений", ТелеграмГруппаСообщений);
	ВыборкаСообщения = ЗапросСообщенийГруппы.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МенеджерПрогресса = РегистрыСведений.ПрогрессВыполненияСерверныхПроцедур.СоздатьМенеджерЗаписи();
	МенеджерПрогресса.ПолноеИмяОбработчика = "Обработки.ТелеграмКомпоновкаСообщенийГруппы.СкомпоноватьСообщенияГруппыЛинейно";	
	МенеджерПрогресса.Прогресс = 0;
	МенеджерПрогресса.ДатаЗаписи = ТекущаяДата();
	МенеджерПрогресса.Записать(Истина);
	
	ШагПрогресса = 100 / ВыборкаСообщения.Количество();
	ТекущийПроцегресс = 0;
	НомерФайла = 0;
	СообщенияТекст = "Группа номер: " + ТелеграмГруппаСообщений.Номер + " создана: " + ТелеграмГруппаСообщений.Дата + " пользователем: " + ТелеграмГруппаСообщений.ТелеграмКонтакт 
	+ Символы.ПС + ?(НазваниеГруппы = "", "", "Название группы: " + НазваниеГруппы + Символы.ПС)+ Символы.ПС;
	Пока ВыборкаСообщения.Следующий() Цикл
		Если ЗначениеЗаполнено(ВыборкаСообщения.РегистраторТекст) Тогда 
			СообщенияТекст = СообщенияТекст + Строка(ВыборкаСообщения.РегистраторДата) + " - " + ВыборкаСообщения.РегистраторТекст + Символы.ПС;  
		КонецЕсли;
		ВыборкаВложения = ВыборкаСообщения.Выбрать();
		
		Пока ВыборкаВложения.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаВложения.ПутьКФайлу) Тогда
				НомерФайла = НомерФайла + 1;
				РасширениеФайла = Сред(ВыборкаВложения.ПутьКФайлу,СтрНайти(ВыборкаВложения.ПутьКФайлу, ".", НаправлениеПоиска.СКонца)+1); 
				ПолныйПутьНовогоФайла = ПолныйПутьКПапке + "\" + НомерФайла + "_" + Формат(ВыборкаВложения.РегистраторДата, "ДФ=yyyy-MM-dd-ЧЧ-мм-сс") + ?(ВыборкаВложения.Описание="", "", "_" + ВыборкаВложения.Описание) + "." + РасширениеФайла; 		
				КопироватьФайл(ВыборкаВложения.ПутьКФайлу,ПолныйПутьНовогоФайла);		
			КонецЕсли;
		КонецЦикла;		
			
		ТекущийПроцегресс = ТекущийПроцегресс + ШагПрогресса;	
		МенеджерПрогресса.Прогресс = Окр(ТекущийПроцегресс, 0, РежимОкругления.Окр15как10);
		МенеджерПрогресса.ДатаЗаписи = ТекущаяДата();
		МенеджерПрогресса.Записать(Истина);
	КонецЦикла;
	
	ПолныйПутьКТекстовомуФайлу = ПолныйПутьКПапке + "\0_Группа номер " + Строка(ТелеграмГруппаСообщений.Номер) + ".txt";   
	ЗаписьТекста = Новый ЗаписьТекста();
	ЗаписьТекста.Открыть(ПолныйПутьКТекстовомуФайлу);
	ЗаписьТекста.Записать(СообщенияТекст);
	ЗаписьТекста.Закрыть();
	
	//Геоданные 
	ЗапросГеоданных = Новый Запрос();
	ЗапросГеоданных.Текст = "ВЫБРАТЬ
	                        |	ТелеграмГеоданныеКонтакта.Период КАК Период,
	                        |	ТелеграмГеоданныеКонтакта.latitude КАК latitude,
	                        |	ТелеграмГеоданныеКонтакта.longitude КАК longitude
	                        |ИЗ
	                        |	(ВЫБРАТЬ
	                        |		ПериодыОткрытияГруппы.Период КАК ПериодОткрытия,
	                        |		МИНИМУМ(ПериодыЗакрытияГруппы.Период) КАК ПериодЗакрытия
	                        |	ИЗ
	                        |		(ВЫБРАТЬ
	                        |			ТелеграмГруппыСообщенийСостояние.Период КАК Период
	                        |		ИЗ
	                        |			РегистрСведений.ТелеграмГруппыСообщенийСостояние КАК ТелеграмГруппыСообщенийСостояние
	                        |		ГДЕ
	                        |			ТелеграмГруппыСообщенийСостояние.Открыта
	                        |			И ТелеграмГруппыСообщенийСостояние.ТелеграмГруппаСообщений = &ТелеграмГруппаСообщений) КАК ПериодыОткрытияГруппы
	                        |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                        |				ТелеграмГруппыСообщенийСостояние.Период КАК Период
	                        |			ИЗ
	                        |				РегистрСведений.ТелеграмГруппыСообщенийСостояние КАК ТелеграмГруппыСообщенийСостояние
	                        |			ГДЕ
	                        |				НЕ ТелеграмГруппыСообщенийСостояние.Открыта
	                        |				И ТелеграмГруппыСообщенийСостояние.ТелеграмГруппаСообщений = &ТелеграмГруппаСообщений) КАК ПериодыЗакрытияГруппы
	                        |			ПО ПериодыОткрытияГруппы.Период < ПериодыЗакрытияГруппы.Период
	                        |	
	                        |	СГРУППИРОВАТЬ ПО
	                        |		ПериодыОткрытияГруппы.Период) КАК ВложенныйЗапрос
	                        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелеграмГеоданныеКонтакта КАК ТелеграмГеоданныеКонтакта
	                        |		ПО ВложенныйЗапрос.ПериодОткрытия <= ТелеграмГеоданныеКонтакта.Период
	                        |			И ВложенныйЗапрос.ПериодЗакрытия >= ТелеграмГеоданныеКонтакта.Период
	                        |ГДЕ
	                        |	ТелеграмГеоданныеКонтакта.ТелеграмКонтакт = &ТелеграмКонтакт
	                        |
	                        |УПОРЯДОЧИТЬ ПО
	                        |	Период";
	ЗапросГеоданных.УстановитьПараметр("ТелеграмГруппаСообщений", ТелеграмГруппаСообщений);
	ЗапросГеоданных.УстановитьПараметр("ТелеграмКонтакт", ТелеграмГруппаСообщений.ТелеграмКонтакт);
	ВыборкаГеоданных = ЗапросГеоданных.Выполнить().Выбрать();
	
	ПолныйПутьКТекстовомуФайлуГеоданных = ПолныйПутьКПапке + "\0_Геоданные.txt";
	ЗаписьТекста.Открыть(ПолныйПутьКТекстовомуФайлуГеоданных);
	Пока ВыборкаГеоданных.Следующий() Цикл
		ЗаписьТекста.ЗаписатьСтроку(Строка(ВыборкаГеоданных.Период) + " - latitude: " + ВыборкаГеоданных.latitude + " longitude: " + ВыборкаГеоданных.longitude);  	
	КонецЦикла;
	ЗаписьТекста.Закрыть();
	
	МенеджерПрогресса.Прогресс = 100;
	МенеджерПрогресса.ДатаЗаписи = ТекущаяДата();
	МенеджерПрогресса.Записать(Истина);

	Возврат ПолныйПутьКПапке;
	
КонецФункции
